fortytwosystems/ArduinoCore-samc/boards.txt

# FortyTwo Systems Uno (SAMC21G)
# ---------------------------------------
uno.name=FortyTwo Systems Uno
uno.vid.0=0x0403
uno.pid.0=0x6015

uno.upload.tool=bossac
uno.upload.protocol=sam-ba
uno.upload.maximum_size=262144
uno.upload.maximum_data_size=32768
uno.upload.use_1200bps_touch=false
uno.upload.wait_for_upload_port=false
uno.upload.native_usb=false

uno.build.mcu=cortex-m0plus
uno.build.f_cpu=48000000L
uno.build.usb_product="FortyTwo Systems Uno"
uno.build.usb_manufacturer="FortyTwo Systems"
uno.build.board=SAMC_UNO
uno.build.core=arduino
uno.build.extra_flags=-D__SAMC21G18A__ -DSAMC21 {build.usb_flags} -I{runtime.tools.CMSIS-Microchip-1.0.0.path}/samc21/include
uno.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
uno.build.openocdscript=openocd_scripts/uno.cfg
uno.build.variant=uno
uno.build.variant_system_lib=
uno.build.vid=0x0403
uno.build.pid=0x6015

uno.bootloader.tool=openocd
uno.bootloader.file=fortytwo_uno/fortytwo_uno.hex

# FortyTwo Systems Mega (SAMC21N)
# --------------------------------------
mega.name=FortyTwo Systems Mega
mega.vid.0=0x0403
mega.pid.0=0x6015

mega.upload.tool=bossac
mega.upload.protocol=sam-ba
mega.upload.maximum_size=262144
mega.upload.maximum_data_size=32768
mega.upload.use_1200bps_touch=false
mega.upload.wait_for_upload_port=false
mega.upload.native_usb=false

mega.build.mcu=cortex-m0plus
mega.build.f_cpu=48000000L
mega.build.usb_product="FortyTwo Systems Mega"
mega.build.usb_manufacturer="FortyTwo Systems"
mega.build.board=SAMC_MEGA
mega.build.core=arduino
mega.build.extra_flags=-D__SAMC21N18A__ -DSAMC21N -DSAMC21 {build.usb_flags} -I{runtime.tools.CMSIS-Microchip-1.0.0.path}/samc21n/include
mega.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mega.build.openocdscript=openocd_scripts/mega.cfg
mega.build.variant=mega
mega.build.variant_system_lib=
mega.build.vid=0x0403
mega.build.pid=0x6015

mega.bootloader.tool=openocd
mega.bootloader.file=fortytwo_mega/fortytwo_mega.hex